[
    {
        "name": "Benefits of Exercise",
        "discussion": "Exercise has tremendous benefits for your body and mind. Some of the obvious benefits include improved energy level, improved strength level, improved mood and self-esteem, improved sleep, reduced stress level and improved overall health status."
    },
    {
        "name": "Types of Exercise",
        "discussion": "There are different categories of exercise which include: *strength or resistance training which strengthen the targeted muscle groups, *cardio which is short for cardiorespiratory aerobic exercise and which improves the cardiovascular and respiratory systems' ability to deliver oxygen and remove waste products from tissues, *core and balance exercises which strengthen and train your lower back, hips, abdomen and pelvis to work together for better balance and stability, *flexiblity exercises to improve posture, form, range of motion, and strengthen tendons and ligaments, *advanced types of exercise like Yoga, Pilates, and Crossfit"
    },
    {
        "name": "Starting An Exercise Program",
        "discussion": "It is important to design an exercise program that will help you meet your fitness goals. You should use your currently fitness level as a guide to determine the intensity and selection of your exercises. It is generally recommended that you start low (in terms of intensity) and progress slowly in order to avoid injuries and excessive strain on the body. It is also recommended that you allow adequate time for your body to recover from an exercise routine before exercising that bodypart again. Cardio types of exercise should be done for a minimum of 20 minutes at least 3 times a week to have a meaningful impact on your fitness level. Resistance training for each of the major muscle groups should be done twice a week to have a meaningful impact on your strength level. Core, flexibility and balance exercises should also be worked into your weekly routine in order to have a balance exercise program."
    },
    {
        "name": "Common Goals For An Exercise Program",
        "discussion": "It is an absolute recommendation that anyone engaging in an exercise program create goals for that program. These goals will guide the type of exercise program that you design. Common goals include: *Lose fat, *Build muscle, *Get stronger, *Improve endurance/conditioning, *Improve athletic skills, *Improve joint flexibility, *tone, sculpt, and/or firm up."
    },
    {
        "name": "Using Fitness Parameters to Determine If You Are Achieving Results",
        "discussion": "Regular self-assessments of your personal fitness parameters will allow you to determine if you are achieving meaningful results from your program. These fitness parameters include: *your pulse rate before and immediately after walking 1 mile (1.6 kilometers), *how long it takes to walk 1 mile, or how long it takes to run 1.5 miles (2.41 kilometers), *how many standard or modified pushups you can do at a time, *how far you can reach forward while seated on the floor with your legs in front of you, *your waist circumference, just above your hipbones, *your body mass index."
    },
    {
        "name": "General Exercise Principles to Follow",
        "discussion": "It is important to consume adequate nutrition to fuel your workouts and your recoveries. Adequate complex carbohydrates and protein intake is essential for achieving optimal results from an exercise routine. A 5 minute warm-up is recommended before your workout in order to prepare your body for physical activity. The warm-up is generally used to increase body temperature, increase heart rate and breathing rate, and also help you mentally prepare for exercise. Similarly, a cool-down at the end of a workout provides the body with a smooth transition from exercise back to a steady state of rest. The general goals of a cool-down is to reduce heart and breathing rates, gradually cool body temperature, return muscles to their optimal length-tension relationships, prevent venous pooling of blood in the lower extremities, which may cause dizziness or possible fainting, and restore physiologic systems close to baseline."
    }
]