[
    {
        "name": "Benefits of Exercise",
        "discussion": "Exercise has tremendous benefits for your body and mind. Some of the obvious benefits include improved energy level, improved strength level, improved mood and self-esteem, improved sleep, reduced stress level and improved overall health status."
    },
    {
        "name": "Types of Exercise",
        "discussion": "There are different categories of exercise which include: *strength or resistance training which strengthen the targeted muscle groups, *cardio which is short for cardiorespiratory aerobic exercise and which improves the cardiovascular and respiratory systems' ability to deliver oxygen and remove waste products from tissues, *core and balance exercises which strengthen and train your lower back, hips, abdomen and pelvis to work together for better balance and stability, *flexiblity exercises to improve posture, form, range of motion, and strengthen tendons and ligaments, *advanced types of exercise like Yoga, Pilates, and Crossfit"
    },
    {
        "name": "Starting An Exercise Program",
        "discussion": "It is important to design an exercise program that will help you meet your fitness goals. You should use your currently fitness level as a guide to determine the intensity and selection of your exercises. It is generally recommended that you start low (in terms of intensity) and progress slowly in order to avoid injuries and excessive strain on the body. It is also recommended that you allow adequate time for your body to recover from an exercise routine before exercising that bodypart again. Cardio types of exercise should be done for a minimum of 20 minutes at least 3 times a week to have a meaningful impact on your fitness level. Resistance training for each of the major muscle groups should be done twice a week to have a meaningful impact on your strength level. Core, flexibility and balance exercises should also be worked into your weekly routine in order to have a balance exercise program."
    },
    {
        "name": "Common Goals For An Exercise Program",
        "discussion": "It is an absolute recommendation that anyone engaging in an exercise program create goals for that program. These goals will guide the type of exercise program that you design. Common goals include: *Lose fat, *Build muscle, *Get stronger, *Improve endurance/conditioning, *Improve athletic skills, *Improve joint flexibility, *tone, sculpt, and/or firm up."
    },
    {
        "name": "Using Fitness Parameters to Determine If You Are Achieving Results",
        "discussion": "Regular self-assessments of your personal fitness parameters will allow you to determine if you are achieving meaningful results from your program. These fitness parameters include: *your pulse rate before and immediately after walking 1 mile (1.6 kilometers), *how long it takes to walk 1 mile, or how long it takes to run 1.5 miles (2.41 kilometers), *how many standard or modified pushups you can do at a time, *how far you can reach forward while seated on the floor with your legs in front of you, *your waist circumference, just above your hipbones, *your body mass index."
    },
    {
        "name": "Cardio-Respiratory Exercise Recommendations",
        "discussion": "If you become easily winded when going up 1 or 2 flights of stairs or from performing similar exertional activities, then you are likely out of shape. The fitness parameter to check for this assessment is your resting pulse and your pulse immediately after walking 1 mile. The higher the pulse rate, the worse you are out of shape. Now the basic way to get your body back in shape is to do cardio or aerobic exercises. The recommended minimum to achieve meaningful improvements is to perform a cardio exercise for 20 minutes at least 3 times a week. Remember that the aerobic activity is one where your heart-rate is elevated for a sustained period of time forcing the cardiovascular system to get stronger and more efficient. As your fitness level improves, you can make the cardio exercise more intense leading to higher heart-rate levels during the exercise. You can also perform the exercises for a longer period of time and up to 5 times a week. Remember that you should recover by at least 90% prior to engaging in the next workout or you will not benefit from the exercise."
    },
    {
        "name": "Creating a Balanced Workout Plan",
        "discussion": "The recommended layout for a workout is to have a 5 minute warm-up followed by the main workout which can be a combination of resistance training and/or cardio exercise. Ideally, all major muscle groups (shoulders, arms, chest, back, legs, and core) should be worked out twice a week. If you are interested in significant muscle gains, bodybuilding or strength gains, then you will want to use higher weights and lower reps during your last several workout sets in order to stimulate greater muscle tissue growth. If you are only interested in general conditioning and toning up, then you can achieve these results by using moderate weight and repititions in the range of 10 to 15 during resistance training sets. Always make sure that you are adequately warmed up when engaging in resistance training and that you use assistance in the form of a spotter when lifting weights ranges that can lead to full muscle fatigue. Once The main workout is completed, it is important to use a 5 minute cool-down to gradually transition your body back to a state of rest."
    },
    {
        "name": "Additional General Exercise Principles to Follow",
        "discussion": "It is important to consume adequate nutrition to fuel your workouts and your recoveries. Adequate complex carbohydrates and protein intake is essential for achieving optimal results from an exercise routine. A 5 minute warm-up is recommended before your workout in order to prepare your body for physical activity. The warm-up is generally used to increase body temperature, increase heart rate and breathing rate, and also help you mentally prepare for exercise. Similarly, a cool-down at the end of a workout provides the body with a smooth transition from exercise back to a steady state of rest. The general goals of a cool-down is to reduce heart and breathing rates, gradually cool body temperature, return muscles to their optimal length-tension relationships, prevent venous pooling of blood in the lower extremities, which may cause dizziness or possible fainting, and restore physiologic systems close to baseline."
    },
    {
        "name": "Exercising for Weight Loss: It's A Complex Topic",
        "discussion": "We now live in a world where there is an unlimited amount of delicious, processed food at our fingertips. As such a sustained, balanced exercise routine can help an overweight or obese person burn extra calories and increase the body's metabolism by adding more lean muscle mass to the body. In general though, a person's food intake is the main determinant of their weight status. If the person compulsively overeats a lot of processed foods, then they are more likely to be overweight or obese. Conversely, if the person eats modest, balanced meals and stops the eating when they are full or feel satiated, then they will likely have a normal weight status. There are also other factors that need to be considered including underlying metabolic disorders like hypothyroidism, which can lead to weight gain by slowing down the metabolism. We at Omega recommend that if you are experiencing stubborn weight loss or the lack of weight loss even when exercising and following a reduced calorie diet, that you see your medical professional and discuss this with them so that they can initiate further testing and screening for a medical cause of the weight gain."
    }
]